app/controllers/filing_controller.rb

  def annual
    @company = Company.find (params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 3]]